{
  "architectures": [
    "Llama4ForCausalLM"
  ],
  "attention_bias": false,
  "attention_chunk_size": 8192,
  "attention_dropout": 0.0,
  "attn_scale": 0.1,
  "attn_temperature_tuning": 4,
  "bos_token_id": 200000,
  "cache_implementation": "hybrid",
  "dtype": "bfloat16",
  "eos_token_id": 200008,
  "floor_scale": 8192,
  "for_llm_compressor": false,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.02,
  "interleave_moe_layer_step": 1,
  "intermediate_size": 8192,
  "intermediate_size_mlp": 16384,
  "layer_types": [
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention",
    "chunked_attention",
    "chunked_attention",
    "chunked_attention",
    "full_attention"
  ],
  "max_position_embeddings": 10485760,
  "model_type": "llama4_text",
  "moe_layers": [
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30,
    31,
    32,
    33,
    34,
    35,
    36,
    37,
    38,
    39,
    40,
    41,
    42,
    43,
    44,
    45,
    46,
    47
  ],
  "no_rope_layers": [
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0,
    1,
    1,
    1,
    0
  ],
  "num_attention_heads": 40,
  "num_experts_per_tok": 1,
  "num_hidden_layers": 48,
  "num_key_value_heads": 8,
  "num_local_experts": 16,
  "output_router_logits": false,
  "pad_token_id": 200018,
  "quantization_config": {
    "_load_in_4bit": true,
    "_load_in_8bit": false,
    "bnb_4bit_compute_dtype": "bfloat16",
    "bnb_4bit_quant_storage": "bfloat16",
    "bnb_4bit_quant_type": "nf4",
    "bnb_4bit_use_double_quant": false,
    "llm_int8_enable_fp32_cpu_offload": false,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": null,
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 16.0,
    "high_freq_factor": 1.0,
    "low_freq_factor": 1.0,
    "original_max_position_embeddings": 8192,
    "rope_type": "llama3"
  },
  "rope_theta": 500000.0,
  "router_aux_loss_coef": 0.001,
  "router_jitter_noise": 0.0,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.0",
  "use_cache": false,
  "use_qk_norm": true,
  "vocab_size": 202048,
  "torch_dtype": "bfloat16"
}
