{
  "base_model": "meta-llama/Llama-4-Scout-17B-16E-Instruct",
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "r": 16,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "target_modules": ["q_proj", "v_proj", "k_proj", "o_proj"],
  "bias": "none",
  "platform": "AutoScientist",
  "dataset": "Karthikrv/adaption-legal-clause-simplification",
  "dataset_rows": 3477,
  "prompt_template": "Simplify this legal clause into plain English for a general audience: {input}",
  "output_model": "Karthikrv/Legal-Document-Simplifier-Llama4"
}
